fix PT_reader v1.1. update version check & get sd ID, add README
